{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "batch_input_shape": [null, 4096], "input_dtype": "float32", "output_dim": 512, "init": "glorot_normal", "activation": "relu", "W_regularizer": {"name": "WeightRegularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 4096}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.6}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "output_dim": 32, "init": "glorot_normal", "activation": "linear", "W_regularizer": {"name": "WeightRegularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.6}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "output_dim": 1, "init": "glorot_normal", "activation": "sigmoid", "W_regularizer": {"name": "WeightRegularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null}}], "keras_version": "1.1.0"}